In [1]:
import pandas as pd

In [2]:
data_frame = pd.DataFrame()

In [3]:
data_frame

Empty DataFrame
Columns: []
Index: []

In [4]:
type(data_frame)

pandas.core.frame.DataFrame

In [ ]:
list
dict
series
numpy array

In [5]:
data = [1,2,3,4,5]

In [6]:
pd.DataFrame(data)

   0
0  1
1  2
2  3
3  4
4  5

In [7]:
data2 = ['krushna',20],["Santosh",21],["Ritesh",23]

In [8]:
pd.DataFrame(data2)

         0   1
0  krushna  20
1  Santosh  21
2   Ritesh  23

In [17]:
pd.DataFrame(data2,columns = ["Name","Age"],index=["first","second","third"])

           Name  Age
first   krushna   20
second  Santosh   21
third    Ritesh   23

In [10]:
data3 = {"Name":["Krishna","Nishant","Avinash"],"Age":[20,21,22]}

In [11]:
pd.DataFrame(data3)

      Name  Age
0  Krishna   20
1  Nishant   21
2  Avinash   22

In [15]:
data4 = {"col1":25,"col2":30},{"col1":20,"col2":34,"col3":34}

In [16]:
pd.DataFrame(data4)

   col1  col2  col3
0    25    30   NaN
1    20    34  34.0

In [21]:
data = '''{
    "name":"krushna teli",
    "phone_no":984984844,
    "company_name":["JP morgan","amazon","microsoft"]
}'''

In [24]:
import json
d = json.loads(data)

In [26]:
d

{'name': 'krushna teli',
 'phone_no': 984984844,
 'company_name': ['JP morgan', 'amazon', 'microsoft']}

In [27]:
type(d)

dict

In [28]:
pd.DataFrame(d)

           name   phone_no company_name
0  krushna teli  984984844    JP morgan
1  krushna teli  984984844       amazon
2  krushna teli  984984844    microsoft